---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSplitJoinHostsInplaceFamilies
source: html/b7235de7-aec4-52c4-585b-d97e3064b3e2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSplitJoinHostsInplaceFamilies Property

Can't split/join this host because there are instances of In-place Families that cut openings into it. Edit or delete instances first so they don't cut into the host to be split or joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSplitJoinHostsInplaceFamilies { get; }
```